package com.ajacker.jobspider.util;

import java.util.Arrays;
import java.util.Collections;
import java.util.HashMap;
import java.util.List;

/**
 * @author ajacker
 * @date 2019/10/27 22:07
 */
public class AreaUtil {
    public static HashMap<String, List<String>> province = new HashMap<>();

    static {
        province.put("北京", Collections.singletonList("北京"));
        province.put("上海", Collections.singletonList("上海"));
        province.put("天津", Collections.singletonList("天津"));
        province.put("重庆", Collections.singletonList("重庆"));
        province.put("黑龙江", Arrays.asList("哈尔滨", "齐齐哈尔", "牡丹江", "大庆", "伊春", "双鸭山", "鹤岗", "鸡西", "佳木斯", "七台河", "黑河", "绥化", "大兴安岭"));
        province.put("吉林", Arrays.asList("长春", "延边", "吉林", "白山", "白城", "四平", "松原", "辽源", "大安", "通化"));
        province.put("辽宁", Arrays.asList("沈阳", "瓦房店", "盘锦", "大连", "葫芦岛", "旅顺", "本溪", "抚顺", "铁岭", "辽阳", "营口", "阜新", "朝阳", "锦州", "丹东", "鞍山"));
        province.put("内蒙古", Arrays.asList("呼和浩特", "呼伦贝尔", "锡林浩特", "包头", "赤峰", "海拉尔", "乌海", "鄂尔多斯", "通辽"));
        province.put("河北", Arrays.asList("石家庄", "唐山", "张家口", "廊坊", "邢台", "邯郸", "沧州", "衡水", "承德", "保定", "秦皇岛"));
        province.put("河南", Arrays.asList("郑州", "开封", "洛阳", "平顶山", "焦作", "鹤壁", "新乡", "安阳", "濮阳", "许昌", "漯河", "三门峡", "南阳", "商丘", "信阳", "周口", "驻马店"));
        province.put("山东", Arrays.asList("济南", "威海", "胶南", "章丘", "莱州", "莱西", "蓬莱", "荣成", "胶州", "文登", "青岛", "淄博", "乳山", "即墨", "寿光", "招远", "平度", "曲阜", "临沂", "烟台", "枣庄", "聊城", "济宁", "菏泽", "泰安", "日照", "东营", "德州", "滨州", "莱芜", "潍坊"));
        province.put("山西", Arrays.asList("太原", "阳泉", "晋城", "晋中", "临汾", "运城", "长治", "朔州", "忻州", "大同", "吕梁"));
        province.put("江苏", Arrays.asList("南京", "句容", "苏州", "江阴", "金坛", "海门", "溧阳", "张家港", "吴江", "昆山", "南通", "太仓", "吴县", "徐州", "宜兴", "镇江", "淮安", "常熟", "盐城", "泰州", "无锡", "连云港", "扬州", "常州", "宿迁"));
        province.put("安徽", Arrays.asList("合肥", "巢湖", "蚌埠", "安庆", "六安", "滁州", "马鞍山", "阜阳", "宣城", "铜陵", "淮北", "芜湖", "毫州", "宿州", "淮南", "池州"));
        province.put("陕西", Arrays.asList("西安", "韩城", "安康", "汉中", "宝鸡", "咸阳", "榆林", "渭南", "商洛", "铜川", "延安"));
        province.put("宁夏", Arrays.asList("银川", "固原", "中卫", "石嘴山", "吴忠"));
        province.put("甘肃", Arrays.asList("兰州", "嘉峪关", "白银", "庆阳", "酒泉", "天水", "武威", "张掖", "甘南", "临夏", "平凉", "定西", "金昌"));
        province.put("青海", Arrays.asList("西宁", "海北", "海西", "黄南", "果洛", "玉树", "海东", "海南"));
        province.put("湖北", Arrays.asList("武汉", "宜昌", "黄冈", "恩施", "荆州", "神农架", "十堰", "咸宁", "襄樊", "孝感", "随州", "黄石", "荆门", "鄂州"));
        province.put("湖南", Arrays.asList("长沙", "邵阳", "常德", "郴州", "吉首", "株洲", "娄底", "湘潭", "益阳", "永州", "岳阳", "衡阳", "怀化", "韶山", "张家界"));
        province.put("浙江", Arrays.asList("杭州", "临安", "义乌", "诸暨", "富阳", "湖州", "金华", "宁波", "丽水", "绍兴", "雁荡山", "衢州", "嘉兴", "台州", "舟山", "温州"));
        province.put("江西", Arrays.asList("南昌", "萍乡", "九江", "上饶", "抚州", "吉安", "鹰潭", "宜春", "新余", "景德镇", "赣州"));
        province.put("福建", Arrays.asList("福州", "厦门", "龙岩", "南平", "宁德", "莆田", "泉州", "三明", "漳州"));
        province.put("贵州", Arrays.asList("贵阳", "安顺", "赤水", "遵义", "铜仁", "六盘水", "毕节", "凯里", "都匀"));
        province.put("四川", Arrays.asList("成都", "泸州", "内江", "凉山", "阿坝", "巴中", "广元", "乐山", "绵阳", "德阳", "攀枝花", "雅安", "宜宾", "自贡", "甘孜州", "达州", "资阳", "广安", "遂宁", "眉山", "南充"));
        province.put("广东", Arrays.asList("广州", "深圳", "潮州", "韶关", "湛江", "惠州", "清远", "东莞", "江门", "茂名", "肇庆", "汕尾", "河源", "揭阳", "梅州", "中山", "德庆", "阳江", "云浮", "珠海", "汕头", "佛山"));
        province.put("广西", Arrays.asList("南宁", "桂林", "阳朔", "柳州", "梧州", "玉林", "桂平", "贺州", "钦州", "贵港", "防城港", "百色", "北海", "河池", "来宾", "崇左"));
        province.put("云南", Arrays.asList("昆明", "保山", "楚雄", "德宏", "红河", "临沧", "怒江", "曲靖", "思茅", "文山", "玉溪", "昭通", "丽江", "大理"));
        province.put("海南", Arrays.asList("海口", "三亚", "儋州", "琼山", "通什", "文昌"));
        province.put("新疆", Arrays.asList("乌鲁木齐", "阿勒泰", "阿克苏", "昌吉", "哈密", "和田", "喀什", "克拉玛依", "石河子", "塔城", "库尔勒", "吐鲁番", "伊宁"));
        province.put("西藏", Arrays.asList("拉萨", "昌都地区", "山南地区", "阿里地区", "那曲地区", "林芝地区", "日喀则地区"));
        province.put("香港", Arrays.asList("香港", "中西区", "东区", "南区", "湾仔区", "九龙城区", "观塘区", "深水埗区", "黄大仙区", "油尖旺区", "离岛区", "葵青区", "北区", "西贡区", "沙田区", "大埔区", "荃湾区", "屯门区", "元朗区"));
        province.put("澳门", Arrays.asList("澳门", "花地玛堂区", "圣安多尼堂区", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区", "圣方济各堂区"));
        province.put("台湾", Arrays.asList("台湾", "基隆市", "嘉义市", "新竹市", "中华台北", "台中市", "台南市", "新北市", "高雄市", "桃园市"));
    }

}
